'''
Иван Васильевич пришел на рынок и решил
купить два арбуза: один для себя, а другой для тещи.
Понятно, что для себя нужно выбрать арбуз
потяжелей, а для тещи полегче. Но вот незадача:
арбузов слишком много и он не знает как же выбрать
самый легкий и самый тяжелый арбуз? Помогите ему!
Пользователь вводит одно число N – количество
арбузов. Вторая строка содержит N чисел,
записанных на новой строчке каждое. Здесь каждое
число – это масса соответствующего арбуза

Input: 5 -> 5 1 6 5 9
Output: 1 9
'''
n = int(input("Vvedite kol-vo arbuzov: "))
min_m = None
max_m = 0
for i in range(n):
    m = int(input("Vvedite massu arbiza: "))
    if m < min_m:
        min_m = m
    elif m > max_m:
        max_m = m
print(min_m, max_m)