'''
В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.

В случае с английским алфавитом очки распределяются так:
A, E, I, O, U, L, N, S, T, R – 1 очко;
D, G – 2 очка;
B, C, M, P – 3 очка;
F, H, V, W, Y – 4 очка;
K – 5 очков;
J, X – 8 очков;
Q, Z – 10 очков.


А русские буквы оцениваются так:
А, В, Е, И, Н, О, Р, С, Т – 1 очко;
Д, К, Л, М, П, У – 2 очка;
Б, Г, Ё, Ь, Я – 3 очка;
Й, Ы – 4 очка;
Ж, З, Х, Ц, Ч – 5 очков;
Ш, Э, Ю – 8 очков;
Ф, Щ, Ъ – 10 очков.

Напишите программу, которая вычисляет стоимость введенного пользователем слова k и выводит его.
Будем считать, что на вход подается только одно слово, которое содержит либо только английские,sh
либо только русские буквы.

k = 'ноутбук'
# 12
'''

k = 'ноутбук'
k_up = k.upper()

point1 = ['А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т',
          'A', "E", 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R']
point2 = ['D', 'G', 'Д', 'К', 'Л', 'М', 'П', 'У']
point3 = ['B', 'C', 'M', 'P', 'Б', 'Г', 'Ё', 'Ь', 'Я']
point4 = ['F', 'H', 'V', 'W', 'Y', 'Й', 'Ы']
point5 = ['K', 'Ж', 'З', 'Х', 'Ц', 'Ч']
point8 = ['J', 'X', 'Ш', 'Э', 'Ю']
point10 = ['Ф', 'Щ', 'Ъ', 'Q', 'Z']


count = 0
for i in k_up:
    if i in point1:
        count += 1
    elif i in point2:
        count += 2
    elif i in point3:
        count += 3
    elif i in point4:
        count += 4
    elif i in point5:
        count += 5
    elif i in point8:
        count += 8
    elif i in point10:
        count += 10

print(count)

# Better way with dict - {}:

points = {
    1: ['А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т', 'A', "E", 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R'],
    2: ['D', 'G', 'Д', 'К', 'Л', 'М', 'П', 'У'],
    3: ['B', 'C', 'M', 'P', 'Б', 'Г', 'Ё', 'Ь', 'Я'],
    4: ['F', 'H', 'V', 'W', 'Y', 'Й', 'Ы'],
    5: ['K', 'Ж', 'З', 'Х', 'Ц', 'Ч'],
    8: ['J', 'X', 'Ш', 'Э', 'Ю'],
    10: ['Q', 'Z', 'Ф', 'Щ', 'Ъ']
}


for i in k_up:
    for j in points:
        if i in points[j]:
            count += j

print(count)

# Way with .items() method:

count = 0
for i in k_up:
    for j, letters in points.items():
        if i in letters:
            count += j

print(count)