'''
Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
Выдать без повторений в порядке возрастания все те числа, которые 
встречаются в обоих наборах.

На вход подается 2 числа через пробел: `n m`
`n` - кол-во элементов первого множества.
`m` - кол-во элементов второго множества.
Затем подаются элементы каждого множества через пробел в виде строки. 
! Писать input() не надо

Inpt:
var1 = '5 4' # количество элементов первого и второго множества
var2 = '1 3 5 7 9' # элементы первого множества через пробел
var3 = '2 3 4 5' # элементы второго множества через пробел

Outp:
3 5
'''
var1 = '5 4'  # количество элементов первого и второго множества
var2 = '1 3 5 7 9'  # элементы первого множества через пробел
var3 = '2 3 4 5'  # элементы второго множества через пробел

n, m = [int(x) for x in var1.split()]

# Извлекаем элементы обоих множеств
set1 = set([int(x) for x in var2.split()])
set2 = set([int(x) for x in var3.split()])

# Находим пересечение множеств
intersection_set = set()
for element in set1:
    if element in set2:
        intersection_set.add(element)

# Преобразуем результат в список и сортируем его
result = list(intersection_set)
result.sort()

# Выводим результат в порядке возрастания
print(*result)


# Powered by GPT :(( ne ponyatnaya zadacha
