'''
Уставшие от необычно теплой зимы, жители решили узнать,
действительно ли это самая длинная оттепель за всю историюнаблюдений за погодой. 
Они обратились к синоптикам, а те, всвою очередь, занялись исследованиями статистики запрошлые годы.
Их интересует, сколько дней длилась самаядлинная оттепель. Оттепелью они называют период, вкоторый
среднесуточная температура ежедневно превышала0 градусов Цельсия. 
Напишите программу, помогающуюсиноптикам в работе.Пользователь вводит число N – общее 
количестворассматриваемых дней (1 ≤ N ≤ 100). В следующих строкахрасполагается N целых чисел.
Каждое число – среднесуточная температура всоответствующий день. 
Температуры – целые числа и лежат вдиапазоне от –50 до 50
Input: 6 -> -20 30 -40 50 10 -10
Output: 2
'''
import random
diapasone = -50, 50
def random_massiv (diapasone, count):
    massiv = []
    range = random.randint(diapasone)
# nado dodelat'

elem = int(input("Vvedite chislo dney: "))
t = [-20, 30, -40, 50, 10, -10]
count = 0
summ = 0

for i in t:
    if i > 0:
        count += 1
    else:
        if count > summ:
            summ = count
        count = 0
print(max(count, summ))

        


