'''
Дано натуральное число A > 1. Определите, каким по
счету числом Фибоначчи оно является, то есть
выведите такое число n, что φ(n)=A. Если А не
является числом Фибоначчи, выведите число -1

Input: 5
Output: 6
'''
# 0 1 2 3 4 5 6  7  8
# 0 1 1 2 3 5 8 13 21...
num = 5
fib_list = [0, 1]
while fib_list[-1] < num:
    fib_list.append(fib_list[-2] + fib_list[-1])
    #print(fib_list)

print(fib_list[-1])