'''
Счастливый билет

Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.

Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.

Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.

Вам требуется написать программу, которая проверяет счастливость билета с номером n и выводит на экран yes или no.

Пример:
n = 385916 -> yes
n = 123456 -> no
'''

n = 123456
n_str = str(n)

pervaya_polovina =  int(n_str[0]) + int(n_str[1]) + int(n_str[2])
vtoraya_polovina = int(n_str[3]) + int(n_str[4]) + int(n_str[5])

if pervaya_polovina == vtoraya_polovina:
    print('yes')
else:
    print('no')