'''
Задача No3. Решение в группахВ некоторой школе решили набрать три новыхматематических класса и оборудовать 
кабинеты дляних новыми партами. За каждой партой может сидетьдва учащихся. Известно количество учащихся 
вкаждом из трех классов. Выведите наименьшеечисло парт, которое нужно приобрести для них.
Input: 20 21 22(ввод чисел НЕ в одну строку)
Output: 32
'''

a = 20
b = 21
c = 22

sum = a + b + c
sum = sum // 2 + sum % 2
print(sum)
