'''
Планеты вращаются вокруг звезд по эллиптическим орбитам. 
Назовем самой далекой планетой ту, орбита которой имеетсамую
большую площадь. Напишите функцию find_farthest_orbit(list_of_orbits), 
которая среди списка орбит планет найдет ту, по которой 
вращается самая далекая планета. Круговые орбиты не учитывайте: вы знаете,
что увашей звезды таких планет нет, зато искусственные спутники
были были запущены на круговые орбиты. Результатом
функции должен быть кортеж, содержащий длины полуосей
эллипса орбиты самой далекой планеты. Каждая орбита
представляет из себя кортеж из пары чисел - полуосей ее
эллипса. Площадь эллипса вычисляется по формуле S = pi*a*b,
где a и b - длины полуосей эллипса. При решении задачи
используйте списочные выражения. Подсказка: проще всего
будет найти эллипс в два шага: сначала вычислить самую
большую площадь эллипса, а затем найти и сам эллипс,
имеющий такую площадь. Гарантируется, что самая далекая
планета ровно одна
'''
# Input:
# orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3)]
# print(*find_farthest_orbit(orbits))
# Output:
# 2.5 10

from math import pi
orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3)]
res = []
max_S = 0
for i in orbits:
    if i[0] != i[1]:
        S = pi * i[0] * i[1]
        if S > max_S:
            max_S = S
            res.append(i)

# Better way:

def find_farthest_orbit(array: list):
    res1 = [i for i in array if i[0] != i[1]]
    res2 = max(map(lambda i: pi * i[0] * i[1], res1))
    for i in res1:
        if pi * i[0] * i[1] == res2:
            return i
print(find_farthest_orbit(orbits))


# More better way:
def find_farthest_orbit(array: list):
    res1 = max(map(lambda i: pi * i[0] * i[1], [i for i in array if i[0] != i[1]]))
    for i in orbits:
        if pi * i[0] * i[1] == res1:
            return i
print(find_farthest_orbit(orbits))
