'''
На столе лежат n монеток. Некоторые из монеток лежат вверх решкой, 
а некоторые – гербом. Ваша задача - определить минимальное количество монеток, 
которые нужно перевернуть, чтобы все монетки лежали одной и той же стороной вверх.

Входные данные:
На вход программе подается список coins, где coins[i] равно 0,
если i-я монетка лежит гербом вверх, и равно 1, если i-я монетка
лежит решкой вверх. Размер списка не превышает 1000 элементов.

Выходные данные:
Программа должна вывести одно целое число - минимальное количество монеток, которые нужно перевернуть.

Input:
coins = [0, 1, 0, 1, 1, 0]
Output:
3
'''
coins = [1, 1, 1, 1, 0]
orel = 0
reshka = 0
if len(coins) > 1000:
    print("Размер списка превышает 1000 элементов!")
else:
    for i in coins:     
        if i == 1:
            orel += 1
        elif i == 0:
            reshka += 1
    if orel > reshka:
        print(reshka)
    elif reshka > orel:
        print(orel)
    elif orel == reshka:
        print(orel)