'''
Напишите рекурсивную функцию sum(a, b), 
возвращающую сумму двух целых неотрицательных чисел. 
Из всех арифметических операций допускаются только +1 и -1. 
Также нельзя использовать циклы.

Функция не должна ничего выводить, только возвращать значение.
Inpt: sum(2, 2)
Outpt: 4
'''


def sum(a: int, b: int) -> int:
    if b == 0:
        return a
    return 1 + sum(a, b-1)


a = 5
b = 7
print(sum(a, b))
